In [1]:
import pandas as pd

In [2]:
behavior = pd.read_csv('QVI_purchase_behaviour.csv')
behavior.head()

   LYLTY_CARD_NBR               LIFESTAGE PREMIUM_CUSTOMER
0            1000   YOUNG SINGLES/COUPLES          Premium
1            1002   YOUNG SINGLES/COUPLES       Mainstream
2            1003          YOUNG FAMILIES           Budget
3            1004   OLDER SINGLES/COUPLES       Mainstream
4            1005  MIDAGE SINGLES/COUPLES       Mainstream

In [3]:
behavior[['AGE','SITUATION']] = behavior['LIFESTAGE'].str.split(' ', expand=True)
behavior.drop('LIFESTAGE', axis=1, inplace=True)
behavior

       LYLTY_CARD_NBR PREMIUM_CUSTOMER     AGE        SITUATION
0                1000          Premium   YOUNG  SINGLES/COUPLES
1                1002       Mainstream   YOUNG  SINGLES/COUPLES
2                1003           Budget   YOUNG         FAMILIES
3                1004       Mainstream   OLDER  SINGLES/COUPLES
4                1005       Mainstream  MIDAGE  SINGLES/COUPLES
...               ...              ...     ...              ...
72632         2370651       Mainstream  MIDAGE  SINGLES/COUPLES
72633         2370701       Mainstream   YOUNG         FAMILIES
72634         2370751          Premium   YOUNG         FAMILIES
72635         2370961           Budget   OLDER         FAMILIES
72636         2373711       Mainstream   YOUNG  SINGLES/COUPLES

[72637 rows x 4 columns]

In [4]:
behavior.AGE.value_counts()

AGE
OLDER       24389
YOUNG       23619
RETIREES    14805
MIDAGE       7275
NEW          2549
Name: count, dtype: int64

In [5]:
behavior[behavior.SITUATION.isna()]

       LYLTY_CARD_NBR PREMIUM_CUSTOMER       AGE SITUATION
10               1013           Budget  RETIREES      None
22               1030       Mainstream  RETIREES      None
23               1034          Premium  RETIREES      None
36               1055       Mainstream  RETIREES      None
48               1074           Budget  RETIREES      None
...               ...              ...       ...       ...
72614         2330081       Mainstream  RETIREES      None
72615         2330121           Budget  RETIREES      None
72616         2330171       Mainstream  RETIREES      None
72619         2330251           Budget  RETIREES      None
72624         2330331           Budget  RETIREES      None

[14805 rows x 4 columns]

In [6]:
behavior.PREMIUM_CUSTOMER.value_counts()

PREMIUM_CUSTOMER
Mainstream    29245
Budget        24470
Premium       18922
Name: count, dtype: int64

In [7]:
behavior.SITUATION.value_counts()

SITUATION
SINGLES/COUPLES    36325
FAMILIES           21507
Name: count, dtype: int64

In [8]:
len(behavior)

72637

In [12]:
behavior.to_csv('purchase_behavior.csv', index=False)